cf_billing/InformationRegisters/энргРасписаниеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРасписаниеНачислений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СбрасыватьВзаиморасчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбрасыватьПоказания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсключаяОтдельностоящие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокЗапуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРезультатВыполненияОперацийНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРезультатВыполненияОперацийНачислений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыполненаУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОперацииСОтборами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИндивидуальныеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппировкиЗаданий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВзаиморасчетыПоследовательность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоследовательность</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировкаОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеПроведения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеДокументаВПоследовательности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргБанкротство</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияРазовыхНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.энргДополнительныеНачисления</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктБездоговорногоПотребления</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПоступлениеОплатыЧерезКонтроллера</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРучноеИзменениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеПоРассрочке</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоказанияПУПоследовательность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоказанияПУПоследовательность</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыводПрибораУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяТабЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеПроведения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеДокументаВПоследовательности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДоговорыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДоговорыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/энргВыполнениеНачислений/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура энргВыполнениеНачислений() Экспорт
	
	ТекВремя = ТекущаяУниверсальнаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргРасписаниеНачислений.Организация КАК Организация,
	|	энргРасписаниеНачислений.Район КАК Район,
	|	энргРасписаниеНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргРасписаниеНачислений.ИсключаяОтдельностоящие КАК ИсключаяОтдельностоящие,
	|	энргРасписаниеНачислений.СбрасыватьВзаиморасчеты КАК СбрасыватьВзаиморасчеты,
	|	энргРасписаниеНачислений.СбрасыватьПоказания КАК СбрасыватьПоказания
	|ИЗ
	|	РегистрСведений.энргРасписаниеНачислений КАК энргРасписаниеНачислений
	|
	|УПОРЯДОЧИТЬ ПО
	|	энргРасписаниеНачислений.ПорядокЗапуска";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МенеджерРС = РегистрыСведений.энргРасписаниеНачислений;
	Пока Выборка.Следующий() Цикл
		
		ПараметрыОтборов = НовыеПараметрыОпераций();		
		ПараметрыОтборов.Организация				= Выборка.Организация;
		ПараметрыОтборов.Район						= Выборка.Район;	
		ПараметрыОтборов.ПериодНачисления			= НачалоМесяца(Выборка.ПериодНачисления);			
		ПараметрыОтборов.ПериодНачисленияТекущий	= ПараметрыОтборов.ПериодНачисления;
		ПараметрыОтборов.ИсключаяОтдельностоящие	= Выборка.ИсключаяОтдельностоящие;
		ПараметрыОтборов.СбрасыватьВзаиморасчеты	= Выборка.СбрасыватьВзаиморасчеты;
		ПараметрыОтборов.СбрасыватьПоказания		= Выборка.СбрасыватьПоказания;
		
		ВыполняемыеОперации = Новый Структура;
		ПолучитьСписокОпераций(ВыполняемыеОперации);		
		ИменаМодулей = ЗаполнитьИменаМодулей();
		
		// запускаем начисления
		энргВыполнитьНачисления(ПараметрыОтборов, ВыполняемыеОперации, ИменаМодулей);		
		
		Если ТранзакцияАктивна() Тогда
			//Прервать;
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		ОчиститьОчередьНачислений(МенеджерРС, Выборка);
		
	КонецЦикла;  	
		
КонецПроцедуры

Процедура энргВыполнитьНачисления(ПараметрыОтборов, ВыполняемыеОперации, ИменаМодулей) Экспорт
	
	Результат = Новый Массив;	
	ПрефиксСобытия = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтборов, "ПрефиксСобытия", ПрефиксСобытияПоУмолчанию());
	ИндексТекОперации = 0;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ПредставлениеОпераций", ПредставлениеОпераций());
	Контекст.Вставить("ИдентификаторЗадания", "" + Новый УникальныйИдентификатор);
	Контекст.Вставить("ПрефиксСобытия", ПрефиксСобытия);
	Контекст.Вставить("ТранзакцияАктивна", Ложь);
	Контекст.Вставить("ПорядокОперации", ИндексТекОперации);
	Контекст.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	Контекст.Вставить("ФиксаторРезультатаВыполнения", РегистрыСведений.энргРезультатВыполненияОперацийНачислений);
	
	
	Для Каждого ТекущаяОперация из ВыполняемыеОперации Цикл 
		
		ИмяОперации = ВыполняемыеОперации["Операция" + ИндексТекОперации];
		ВыполнитьОперацию(ИмяОперации, ПараметрыОтборов, ИменаМодулей, Результат, Контекст);
		ИндексТекОперации = ИндексТекОперации + 1;
		Контекст.ПорядокОперации = ИндексТекОперации;
		
		Если НЕ ПараметрыОтборов.АдресРезультата = Неопределено Тогда 
			Попытка
				
				ПоместитьВоВременноеХранилище(Результат, ПараметрыОтборов.АдресРезультата);	
				
			Исключение
				Инфо = ИнформацияОбОшибке();
			КонецПопытки;
		КонецЕсли;
		
		Если Контекст.ТранзакцияАктивна Тогда
			Прервать;
		КонецЕсли;
				
	КонецЦикла;		
	
КонецПроцедуры

Функция НовыеПараметрыОпераций() Экспорт 
		
	Результат = Новый Структура;
	Результат.Вставить("Организация",			 	Неопределено);
	Результат.Вставить("ПериодНачисления",		 	Неопределено);
	Результат.Вставить("ПериодНачисленияТекущий",	Неопределено);
	Результат.Вставить("ТекРайон",				 	Неопределено);
	Результат.Вставить("Район",					 	Неопределено);
	Результат.Вставить("Абонент",				 	Неопределено);
	Результат.Вставить("ОтборПоДому",			 	Ложь);
	Результат.Вставить("ИсключаяОтдельностоящие", 	Ложь);
	Результат.Вставить("СбрасыватьСостояниеПоследовательности", Истина);
	Результат.Вставить("Договор", 					Справочники.энргДоговорыКонтрагентов.ПустаяСсылка());
	Результат.Вставить("АдресРезультата", 			Неопределено);
	Результат.Вставить("Дом", 						Справочники.энргСтроения.ПустаяСсылка());
	Результат.Вставить("ПрефиксСобытия",			ПрефиксСобытияПоУмолчанию());
	Результат.Вставить("СписокМКД",					Неопределено);
	Результат.Вставить("МассивКлючейПомещений",		Неопределено);
	Результат.Вставить("МассивАбонентов",			Неопределено);
	Результат.Вставить("ФинальноеНачисление",		Ложь);
	Результат.Вставить("СбрасыватьВзаиморасчеты",	Ложь);
	Результат.Вставить("СбрасыватьПоказания",		Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПрефиксСобытияПоУмолчанию() Экспорт 
		
	Возврат "Фоновое начисление";
	
КонецФункции


#Область ОписаниеОпераций

Функция Операции(ТолькоОперацииНП = Ложь) Экспорт
	
	Операции 	= Новый Структура;
	
	мОперации 	= Новый Массив;
	
	#Область РегламетныеОперации
	
	#Область МногоквартирныеДома
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("ЗаполнениеНачальныхОстатковМКД");
		мОперации.Добавить("ВосстановлениеПоследовательностиДокументовМКД");
		мОперации.Добавить("ВосстановлениеПоследовательностиПоказанийМКД");
	КонецЕсли;
	#КонецОбласти
	
	#Область ФизическиеЛица
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("ЗаполнениеНачальныхОстатков");
		мОперации.Добавить("ВосстановлениеПоследовательностиДокументов");
		мОперации.Добавить("ВосстановлениеПоследовательностиПоказанийПУ");
	КонецЕсли;
	#КонецОбласти
	
	#Область НежилыеПомещения
	мОперации.Добавить("ЗаполнениеНачальныхОстатковНП");
	мОперации.Добавить("ВосстановлениеПоследовательностиДокументовНП"); 
	мОперации.Добавить("ВосстановлениеПоследовательностиПоказанийПУНП");
	#КонецОбласти
	
	#КонецОбласти
	
	#Область РассчетНачислений
	
	#Область МногоквартирныеДома
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("ПерерасчетСреднихНачисленийМКД");
		мОперации.Добавить("РасчетНачисленийНаМКД");
		мОперации.Добавить("КорректировкаПотребленияСезонныхУслугМКД");
	КонецЕсли;
	#КонецОбласти
	
	#Область ФизическиеЛица
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("ИндивидуальныеНачисления");	
		мОперации.Добавить("ПерерасчетСреднихНачислений");
		мОперации.Добавить("УстановкаЗначенийДифференцированныхТарифов");
		мОперации.Добавить("ПерерасчетПриУстановкеПрибораУчетаСезонныхУслуг");
		мОперации.Добавить("НачислениеПроцентовРассрочки");
		мОперации.Добавить("РасчетЛьгот");
	КонецЕсли;
	#КонецОбласти
	
	#Область НежилыеПомещения
	мОперации.Добавить("ИндивидуальныеНачисленияНП");
	мОперации.Добавить("НачисленияПоДолевымСхемам");
	мОперации.Добавить("ПерерасчетСреднихНачисленийНП");
	#КонецОбласти
	
	#КонецОбласти
	
	#Область РаспределениеИКорректировка
	Если НЕ ТолькоОперацииНП Тогда
		мОперации.Добавить("РаспределениеОбъемаМКД");
		мОперации.Добавить("КорректировкаПотребленияСезонныхУслуг");
		мОперации.Добавить("ВосстановлениеПоследовательностиВзаиморасчетов");
		мОперации.Добавить("НачислениеПени");
		
	КонецЕсли;
	мОперации.Добавить("НачисленияПоСхемамСтруктурыСети");
	мОперации.Добавить("ДополнительныеНачисленияЮЛ");
	мОперации.Добавить("ВосстановлениеПоследовательностиВзаиморасчетовНП");
	#КонецОбласти
	
	#Область ПрочииОперации
	мОперации.Добавить("ЗакрытиеПериодаНачисления");
	#КонецОбласти 	
	
	Для Сч = 0 По мОперации.ВГраница() Цикл
		Операции.Вставить("Операция" + Формат("" + Сч,"ЧРГ=' '; ЧГ=0"),мОперации[Сч]);
	КонецЦикла; 	
	
	Возврат Операции;
КонецФункции

Функция ПредставлениеОпераций() Экспорт
	
	Результат = Новый Соответствие;
	
	#Область РегламетныеОперации
	
	#Область МногоквартирныеДома
	
	Результат.Вставить(
		"ЗаполнениеНачальныхОстатковМКД", 
		"Выполнение отложенных движений МКД");
	
	Результат.Вставить(
		"ВосстановлениеПоследовательностиДокументовМКД", 
		"Восстановление последовательности документов МКД");
	
	Результат.Вставить(
		"ВосстановлениеПоследовательностиПоказанийМКД", 
		"Восстановление последовательности показаний МКД");
	
	#КонецОбласти
	
	#Область ФизическиеЛица
	
	Результат.Вставить(
		"ЗаполнениеНачальныхОстатков", 
		"Выполнение отложенных движений физ.лица");
	
	Результат.Вставить(
		"ВосстановлениеПоследовательностиДокументов", 
		"Восстановление последовательности документов физ.лица");
	
	Результат.Вставить(
		"ВосстановлениеПоследовательностиПоказанийПУ", 
		"Восстановление последовательности показаний физ.лица");
	
	#КонецОбласти
	
	#Область НежилыеПомещения
	
	Результат.Вставить(
		"ЗаполнениеНачальныхОстатковНП", 
		"Выполнение отложенных движений нежилые помещения");
	
	Результат.Вставить(
		"ВосстановлениеПоследовательностиДокументовНП", 
		"Восстановление последовательности документов нежилые помещения");
	
	Результат.Вставить(
		"ВосстановлениеПоследовательностиПоказанийПУНП", 
		"Восстановление последовательности показаний нежилые помещения");
	
	#КонецОбласти
	
	#КонецОбласти
	
	#Область РассчетНачислений
	
	#Область МногоквартирныеДома
	
	Результат.Вставить(
		"ПерерасчетСреднихНачисленийМКД", 
		"Перерасчет средних начислений МКД");
	
	Результат.Вставить(
		"РасчетНачисленийНаМКД", 
		"Расчет начислений на МКД");
	
	Результат.Вставить(
		"КорректировкаПотребленияСезонныхУслугМКД", 
		"Корректировка потребления сезонных услуг МКД");
	
	#КонецОбласти
	
	#Область ФизическиеЛица
	
	Результат.Вставить(
		"ИндивидуальныеНачисления", 
		"Расчет начислений на физ.лиц");
	
	Результат.Вставить(
		"ПерерасчетСреднихНачислений", 
		"Перерасчет средних начислений на физ.лиц");
	
	Результат.Вставить(
		"УстановкаЗначенийДифференцированныхТарифов", 
		"Установить значения дифференцированных тарифов");
	
	Результат.Вставить(
		"ПерерасчетПриУстановкеПрибораУчетаСезонныхУслуг", 
		"Перерасчет при установке прибора учета сезонных услуг на физ.лиц");
	
	Результат.Вставить(
		"НачислениеПроцентовРассрочки", 
		"Начисление процентов по рассрочке на физ.лиц");
	
	Результат.Вставить(
		"РасчетЛьгот", 
		"Начисление льгот на физ.лиц");
	
	#КонецОбласти
	
	#Область НежилыеПомещения
	
	Результат.Вставить(
		"ИндивидуальныеНачисленияНП", 
		"Расчет начислений на нежилые помещения");
	
	Результат.Вставить(
		"НачисленияПоДолевымСхемам", 
		"Начисления по долевым схемам на нежилые помещения");
	
	Результат.Вставить(
		"ПерерасчетСреднихНачисленийНП", 
		"Перерасчет средних начислений на нежилые помещения");
	
	#КонецОбласти
	
	#КонецОбласти
	
	#Область РаспределениеИКорректировка
	
	Результат.Вставить(
		"РаспределениеОбъемаМКД", 
		"Распределение ОДН");
	
	Результат.Вставить(
		"КорректировкаПотребленияСезонныхУслуг", 
		"Корректировка потребления сезонных услуг");
	
	Результат.Вставить(
		"ВосстановлениеПоследовательностиВзаиморасчетов", 
		"Восстановление последовательности взаиморасчетов");
	
	Результат.Вставить(
		"НачислениеПени", 
		"Начисление пени");
	

	Результат.Вставить(
		"НачисленияПоСхемамСтруктурыСети", 
		"Начисления по схемам структуры сети");
	
	Результат.Вставить(
		"ДополнительныеНачисленияЮЛ", 
		"Дополнительные начисления ЮЛ");
	
	Результат.Вставить(
		"ВосстановлениеПоследовательностиВзаиморасчетовНП", 
		"Восстановление последовательности взаиморасчетов ЮЛ");
	
	#КонецОбласти
	
	#Область ПрочииОперации
	
	Результат.Вставить(
		"ЗакрытиеПериодаНачисления", 
		"Закрытие периода для редактирования");
	
	#КонецОбласти 	 	
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьИменаМодулей() Экспорт
	
	ИменаМодулей = Новый Структура;
	
	ИменаМодулей.Вставить("ЗаполнениеНачальныхОстатковМКД",								"энргРаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисленияМКД");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиДокументовМКД",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериодыМКД");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиПоказанийМКД",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУМКД");
	
	ИменаМодулей.Вставить("ЗаполнениеНачальныхОстатков",								"энргРаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисления");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиДокументов",					"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериоды");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиПоказанийПУ",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУ");
	
	ИменаМодулей.Вставить("ЗаполнениеНачальныхОстатковНП",								"бестРаботаСПоследовательностямиНП.ОтложенныеДвиженияДокументовНачисленияНП");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиДокументовНП",				"бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьСтабильныеПериодыНП");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиПоказанийПУНП",				"бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоказанияПУНП");
	
	ИменаМодулей.Вставить("ПерерасчетСреднихНачисленийМКД",								"энргНачисления.СнятьСредниеНачисленияМКД");
	ИменаМодулей.Вставить("РасчетНачисленийНаМКД",										"энргНачисления.НачислениеНаОДН");
	ИменаМодулей.Вставить("КорректировкаПотребленияСезонныхУслугМКД",					"энргНачисления.СкорректироватьПотреблениеСезонныхУслугМКД");
    
	ИменаМодулей.Вставить("ИндивидуальныеНачисления",									"энргНачисления.Начислить");
	ИменаМодулей.Вставить("ПерерасчетСреднихНачислений",								"энргНачисления.СнятьСредниеНачисления");
	ИменаМодулей.Вставить("УстановкаЗначенийДифференцированныхТарифов",					"энргНачисления.УстановитьЗначенияДифференцированныхТарифов");
	ИменаМодулей.Вставить("ПерерасчетПриУстановкеПрибораУчетаСезонныхУслуг",			"энргНачисления.ИзменитьПризнакСостояниеПрибора");
	ИменаМодулей.Вставить("НачислениеПроцентовРассрочки",								"энргНачисления.НачислениеПоРассрочке");
	ИменаМодулей.Вставить("РасчетЛьгот",												"энргНачисления.НачислитьЛьготы");
	
	ИменаМодулей.Вставить("ИндивидуальныеНачисленияНП",									"бестНачисленияНП.Начислить");
	ИменаМодулей.Вставить("ПерерасчетСреднихНачисленийНП",								"бестНачисленияНП.СнятьСредниеНачисленияНП");
	ИменаМодулей.Вставить("НачисленияПоДолевымСхемам",   								"бестНачисленияНП.НачисленияПоДолевымСхемам"); 
	
	ИменаМодулей.Вставить("РаспределениеОбъемаМКД",										"энргНачисления.РаспредениеОбъемаМКД");
	ИменаМодулей.Вставить("КорректировкаПотребленияСезонныхУслуг",						"энргНачисления.СкорректироватьПотреблениеСезонныхУслуг");
	ИменаМодулей.Вставить("НачисленияПоСхемамСтруктурыСети",							"бестНачисленияНП.НачисленияПоСхемамСтруктурыСети");
	ИменаМодулей.Вставить("ДополнительныеНачисленияЮЛ",									"бестНачисленияНП.ДополнительныеНачисленияЮЛ");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиВзаиморасчетов",				"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты");
	ИменаМодулей.Вставить("ВосстановлениеПоследовательностиВзаиморасчетовНП",			"бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьВзаиморасчетыНП");
	ИменаМодулей.Вставить("НачислениеПени",												"энргНачисления.НачислитьПеню");
	
	ИменаМодулей.Вставить("ЗакрытиеПериодаНачисления",									"энргНачисления.ЗакрытьПериодДляРедактирования");
	
	Возврат ИменаМодулей;
КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыполнениеОпераций

Процедура ВыполнитьОперацию(ИмяОперации, ПараметрыОтборов, ИменаМодулей, РезультатВыполнения, Контекст)
	
	ПропускатьЗаписьРезультатВФиксатор = ИмяОперации = "ЗакрытиеПериодаНачисления";
	СтрокаЗаписиРезультата = Контекст.ФиксаторРезультатаВыполнения.ПолучитьОписаниеОбъекта();
	ЗаполнитьСтрокуРезультатаОперации(СтрокаЗаписиРезультата, ПараметрыОтборов, Контекст, ИмяОперации);	
	
	РезультатВыполненияОперации = РезультатВыполненияОперации();
	РезультатВыполненияОперации.ЭлементОшибок = ИмяОперации;
	
	ИмяМодуля = ИменаМодулей[ИмяОперации];
	СтрокаМодуля = ИмяМодуля + "(ПараметрыОпераций)"; 	
	ПараметрыОпераций = ПараметрыОперацииПоЗаданию(ПараметрыОтборов);
	
	ПредставлениеРайона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОпераций.Район, "Наименование");
	ПредставлениеОперации = "" + Контекст.ПредставлениеОпераций[ИмяОперации] + " по району: " + ПредставлениеРайона + " за " + Формат(ПараметрыОпераций.ПериодНачисления, "ДФ='ММММ гггг'") + "";	
	Если ПараметрыОтборов.ОтборПоДому тогда
		
		ЭтоМКД = ЗначениеЗаполнено(ПараметрыОтборов.Дом);
		ПредставлениеОперации = ПредставлениеОперации + " отбор по дому: " + ?(ЭтоМКД, ПараметрыОтборов.Дом, "Частный сектор");
		
		Если ЭтоМКД Тогда 
			СтрокаЗаписиРезультата.МКД = ПараметрыОтборов.Дом;			
		Иначе 
			СтрокаЗаписиРезультата.ЧастныйСектор = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(1, ПредставлениеОперации);
	
	СтрокаЗаписиРезультата.Строение = ПараметрыОпераций.Строение;
	СтрокаЗаписиРезультата.ПредставлениеОперации = Контекст.ПредставлениеОпераций[ИмяОперации];
	СтрокаЗаписиРезультата.ПредставлениеОперацииСОтборами = ПредставлениеОперации;
	ИмяСобытия = Контекст.ПрефиксСобытия + "." + ПредставлениеРайона + ".Начало операции." + ИмяОперации;
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,,
		Контекст.ИдентификаторЗадания,
		"" + ПредставлениеОперации);		
	
		
	Если НЕ ПропускатьЗаписьРезультатВФиксатор Тогда 
		ЗаписатьНачалоОперации(Контекст, СтрокаЗаписиРезультата);	
	КонецЕсли;
		
	Попытка
		Если ИмяОперации = "ЗаполнениеНачальныхОстатковМКД" Тогда
			энргРаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисленияМКД(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиДокументовМКД" Тогда
			энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериодыМКД(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиПоказанийМКД" Тогда
			энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУМКД(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ЗаполнениеНачальныхОстатков" Тогда
			энргРаботаСПоследовательностями.ОтложенныеДвиженияДокументовНачисления(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиДокументов" Тогда
			энргРаботаСПоследовательностями.ВосстановитьПоследовательностьСтабильныеПериоды(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиПоказанийПУ" Тогда
			
			Если ПараметрыОтборов.СбрасыватьПоказания Тогда
				СброситьПоследовательностьПоказаний(ПараметрыОтборов);
			КонецЕсли;
			
			энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоказанияПУ(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ПерерасчетСреднихНачисленийМКД" Тогда
			энргНачисления.СнятьСредниеНачисленияМКД(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "РасчетНачисленийНаМКД" Тогда
			энргНачисления.НачислениеНаОДН(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ПерерасчетСреднихНачислений" Тогда
			энргНачисления.СнятьСредниеНачисления(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ИндивидуальныеНачисления" Тогда
			энргНачисления.Начислить(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "РаспределениеОбъемаМКД" Тогда
			энргНачисления.РаспредениеОбъемаМКД(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "НачислениеПроцентовРассрочки" Тогда
			энргНачисления.НачислениеПоРассрочке(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ПерерасчетПриУстановкеПрибораУчетаСезонныхУслуг" Тогда
			энргНачисления.ИзменитьПризнакСостояниеПрибора(ПараметрыОпераций);				
		ИначеЕсли ИмяОперации = "КорректировкаПотребленияСезонныхУслуг" Тогда
			энргНачисления.СкорректироватьПотреблениеСезонныхУслуг(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "КорректировкаПотребленияСезонныхУслугМКД" Тогда
			энргНачисления.СкорректироватьПотреблениеСезонныхУслугМКД(ПараметрыОпераций);	
		ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиВзаиморасчетов" Тогда
			
			Если ПараметрыОтборов.СбрасыватьВзаиморасчеты Тогда
				СброситьВзаиморасчеты(ПараметрыОтборов);
			КонецЕсли;

			энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "НачислениеПени" Тогда
			энргНачисления.НачислитьПеню(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ЗакрытиеПериодаНачисления" Тогда
			энргНачисления.ЗакрытьПериодДляРедактирования(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ЗаполнениеНачальныхОстатковНП" Тогда
			бестРаботаСПоследовательностямиНП.ОтложенныеДвиженияДокументовНачисленияНП(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиДокументовНП" Тогда
			бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьСтабильныеПериодыНП(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиПоказанийПУНП" Тогда
			бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоказанияПУНП(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ИндивидуальныеНачисленияНП" Тогда
			бестНачисленияНП.Начислить(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "РасчетЛьгот" Тогда
			энргНачисления.НачислитьЛьготы(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "НачисленияПоДолевымСхемам" Тогда
			бестНачисленияНП.НачисленияПоДолевымСхемам(ПараметрыОпераций);	
			//энргНачисления.НачислитьПоФормуламРасчета(ПараметрыОпераций.Организация,ПараметрыОпераций.ПериодНачисления,ПараметрыОпераций.Район);	
		ИначеЕсли ИмяОперации = "ПерерасчетСреднихНачисленийНП" Тогда
			бестНачисленияНП.СнятьСредниеНачисленияНП(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "НачисленияПоСхемамСтруктурыСети" Тогда
			бестНачисленияНП.НачисленияПоСхемамСтруктурыСети(ПараметрыОпераций);	
		ИначеЕсли ИмяОперации = "ВосстановлениеПоследовательностиВзаиморасчетовНП" Тогда
			бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьВзаиморасчетыНП(ПараметрыОпераций);
		ИначеЕсли ИмяОперации = "ДополнительныеНачисленияЮЛ" Тогда
			бестНачисленияНП.ДополнительныеНачисленияЮЛ(ПараметрыОпераций);	
		Иначе
			Выполнить (СтрокаМодуля);
		КонецЕсли;
		
		
	Исключение
		
		ОписаниеОшибки = ИнформацияОбОшибке();		
		
		РезультатВыполненияОперации.ЕстьОшибки 		= Истина;
		РезультатВыполненияОперации.Заголовок 		= "Есть ошибки";
		РезультатВыполненияОперации.Доступность 	= Истина;	
		
		РезультатВыполненияОперации.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ОписаниеОшибки);		
		РезультатВыполненияОперации.Ошибки.Добавить(Новый Структура("Текст", ОписаниеОшибки.Описание + Символы.ПС + КраткоеПредставлениеОшибки(ОписаниеОшибки)));
		
		ОписаниеОшибки = РезультатВыполненияОперации.ОписаниеОшибки;
		ОписаниеОшибки.Вставить("ПериодНачисления", ПараметрыОтборов.ПериодНачисления);
		ОписаниеОшибки.Вставить("Ораганизация", 	ПараметрыОтборов.Организация);
		ОписаниеОшибки.Вставить("Район",			ПараметрыОтборов.Район);
		ОписаниеОшибки.Вставить("МКД",				Справочники.энргСтроения.ПустаяСсылка());
		Если ПараметрыОтборов.Свойство("Дом") тогда
			ОписаниеОшибки.МКД = ПараметрыОтборов.Дом;
		КонецЕсли;
		ОписаниеОшибки.Вставить("ОтборПоМКД",		ПараметрыОтборов.ОтборПоДому);
		ОписаниеОшибки.Вставить("Ошибки",			РезультатВыполненияОперации.Ошибки); 		
					
	КонецПопытки; 	
	
	РезультатВыполнения.Добавить(РезультатВыполненияОперации);
	ДлительныеОперации.СообщитьПрогресс(100, ПредставлениеОперации);
	
	ИмяСобытия = Контекст.ПрефиксСобытия + "." + ПредставлениеРайона + ".Завершение операции." + ИмяОперации;
	УровеньЖурналаЗавершенияОперации = УровеньЖурналаРегистрации.Информация;
	
	СтрокаЗаписиРезультата.ДатаЗавершения = ТекущаяДатаСеанса();
	СтрокаЗаписиРезультата.ВыполненаУспешно = Истина;
	Если РезультатВыполненияОперации.ЕстьОшибки Тогда 
		УровеньЖурналаЗавершенияОперации = УровеньЖурналаРегистрации.Ошибка;
		
		СтрокаЗаписиРезультата.ВыполненаУспешно = Ложь;
		СтрокаЗаписиРезультата.Ошибки = РезультатВыполненияОперации.ПодробноеПредставлениеОшибки;
	КонецЕсли;
		
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаЗавершенияОперации,,
		Контекст.ИдентификаторЗадания,
		"" + ПредставлениеОперации + Символы.ПС 
			+ "Результат: " 
			+ Символы.ПС + "ЕстьОшибки: " + РезультатВыполненияОперации.ЕстьОшибки
			+ Символы.ПС + "Причина: " + РезультатВыполненияОперации.ПодробноеПредставлениеОшибки);   	
			
			
	Если НЕ ПропускатьЗаписьРезультатВФиксатор Тогда
		ЗаписатьЗавершениеОперации(Контекст, СтрокаЗаписиРезультата);
	КонецЕсли;
	
	Если ТранзакцияАктивна() Тогда
		
		Контекст.ТранзакцияАктивна = Истина;
		ИмяСобытия = Контекст.ПрефиксСобытия + "." + ПредставлениеРайона + ".Активная транзакция." + ИмяОперации;
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,
			Контекст.ИдентификаторЗадания,
			"Транзакция не завершилась"); 				
				
	КонецЕсли;		
	
КонецПроцедуры

Процедура СброситьВзаиморасчеты(ПараметрыОтборов) Экспорт
	Набор  = РегистрыСведений.энргВзаиморасчетыПоследовательность.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(ПараметрыОтборов.Организация);
	Набор.Отбор.ПериодНачисления.Установить(ПараметрыОтборов.ПериодНачисления);
	Набор.Отбор.Район.Установить(ПараметрыОтборов.Район);
	Если ПараметрыОтборов.Свойство("Дом") И ЗначениеЗаполнено(ПараметрыОтборов.Дом) Или ПараметрыОтборов.Свойство("ОтборПоДому") И ПараметрыОтборов.ОтборПоДому ТОгда
		Набор.Отбор.МКД.Установить(ПараметрыОтборов.Дом);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтборов.Абонент) ТОгда
		Набор.Отбор.Абонент.Установить(ПараметрыОтборов.Абонент);
	КонецЕсли;
	
	Набор.Прочитать();
	
	Для Каждого Строка Из Набор Цикл
		Если Строка.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности Тогда
			Строка.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать();
КонецПроцедуры

Процедура СброситьПоследовательностьПоказаний(ПараметрыОтборов) Экспорт
	Набор  = РегистрыСведений.энргПоказанияПУПоследовательность.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(ПараметрыОтборов.Организация);
	Набор.Отбор.ПериодНачисления.Установить(ПараметрыОтборов.ПериодНачисления);
	Набор.Отбор.Район.Установить(ПараметрыОтборов.Район);
	Если ПараметрыОтборов.Свойство("Дом") И ЗначениеЗаполнено(ПараметрыОтборов.Дом)  Тогда 
		Набор.Отбор.Строение.Установить(ПараметрыОтборов.Дом);
	ИначеЕсли ПараметрыОтборов.Свойство("МКД") И ЗначениеЗаполнено(ПараметрыОтборов.МКД)  ТОгда
		Набор.Отбор.Строение.Установить(ПараметрыОтборов.МКД);
	КонецЕсли;
	
	Если ПараметрыОтборов.Свойство("Дом") И НЕ ЗначениеЗаполнено(ПараметрыОтборов.Дом) И ПараметрыОтборов.Свойство("ОтборПоДому") И ПараметрыОтборов.ОтборПоДому ТОгда
		Набор.Отбор.ЧастныйСектор.Установить(Истина);
	ИначеЕсли ПараметрыОтборов.Свойство("ЧастныйСектор") И ПараметрыОтборов.ЧастныйСектор = Истина ТОгда
		Набор.Отбор.ЧастныйСектор.Установить(Истина);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ПараметрыОтборов.Абонент)ТОгда  
		Набор.Отбор.Строение.Установить(ПараметрыОтборов.Абонент.КлючПомещения.Строение);
		Набор.Отбор.Помещение.Установить(ПараметрыОтборов.Абонент.КлючПомещения.Помещение);
	КонецЕсли;
	
	Набор.Прочитать();
	
	Для Каждого Строка Из Набор Цикл
		Если Строка.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности Тогда
			Строка.СостояниеПроведения = Перечисления.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать();
КонецПроцедуры

Функция РезультатВыполненияОперации()
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОшибки"		, Ложь);
	Результат.Вставить("Заголовок"		, "Нет Ошибок");
	Результат.Вставить("Доступность"	, Ложь);
	Результат.Вставить("ИмяОперации"	, "");	
	Результат.Вставить("ЭлементОшибок"	, "");
	Результат.Вставить("ПодробноеПредставлениеОшибки"	, "");
	Результат.Вставить("Ошибки"			, Новый Массив);
	Результат.Вставить("ОписаниеОшибки"	, Новый Структура);
	
	Возврат Результат
	
КонецФункции


Функция ПараметрыОперацииПоЗаданию(ПараметрыОтборов)
	
	ПараметрыОпераций   = Новый Структура;
	ПараметрыОпераций.Вставить("Организация",		ПараметрыОтборов.Организация);
	ПараметрыОпераций.Вставить("ПериодНачисления",	ПараметрыОтборов.ПериодНачисленияТекущий);
	
	Если ПараметрыОтборов.ТекРайон <> Неопределено Тогда
		ПараметрыОпераций.Вставить("Район",	ПараметрыОтборов.ТекРайон);
	Иначе 
		ПараметрыОпераций.Вставить("Район",	ПараметрыОтборов.Район);
	КонецЕсли;
	
	Если ПараметрыОтборов.ОтборПоДому И ЗначениеЗаполнено(ПараметрыОтборов.Дом) Тогда
		ПараметрыОпераций.Вставить("ЧастныйСектор",		Ложь);
	ИначеЕсли ПараметрыОтборов.ОтборПоДому Тогда
		ПараметрыОпераций.Вставить("ЧастныйСектор",		Истина);
	Иначе
		ПараметрыОпераций.Вставить("ЧастныйСектор",		Неопределено);
	КонецЕсли;
	
	//Если ИмяЗадания <> "ВосстановлениеПоследовательностиДокументовНП" тогда
	Если ПараметрыОтборов.ОтборПоДому тогда
		ПараметрыОпераций.Вставить("МКД"	, ПараметрыОтборов.Дом);
		ПараметрыОпераций.Вставить("МКД_НП"	, ?(ПараметрыОтборов.ИсключаяОтдельностоящие, ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка"), ПараметрыОтборов.Дом));
		
	иначе
		ПараметрыОпераций.Вставить("МКД",		Неопределено);
		ПараметрыОпераций.Вставить("МКД_НП",	Неопределено);
	КонецЕсли; 
	//КонецЕсли; 
	
	ПараметрыОпераций.Вставить("Строение",					ПараметрыОтборов.Дом);
	ПараметрыОпераций.Вставить("Помещение",					Неопределено);
	ПараметрыОпераций.Вставить("Абонент",					Неопределено);
	ПараметрыОпераций.Вставить("СписокМКД",					ПараметрыОтборов.СписокМКД);
	ПараметрыОпераций.Вставить("ИсключаяОтдельностоящие",	ПараметрыОтборов.ИсключаяОтдельностоящие);
	
	//Если ИмяЗадания = "ЗаполнениеНачальныхОстатков" тогда
	ПараметрыОпераций.Вставить("СбрасыватьСостояниеПоследовательности", ПараметрыОтборов.СбрасыватьСостояниеПоследовательности);
	//КонецЕсли; 	
	
	ПараметрыОпераций.Вставить("Абонент",					Неопределено);
	ПараметрыОпераций.Вставить("СписокМКД",					ПараметрыОтборов.СписокМКД);
	ПараметрыОпераций.Вставить("ИсключаяОтдельностоящие",	ПараметрыОтборов.ИсключаяОтдельностоящие);
	ПараметрыОпераций.Вставить("МассивКлючейПомещений",		ПараметрыОтборов.МассивКлючейПомещений);
	ПараметрыОпераций.Вставить("МассивАбонентов",			ПараметрыОтборов.МассивАбонентов);
	ПараметрыОпераций.Вставить("ФинальноеНачисление",		ПараметрыОтборов.ФинальноеНачисление);
	
	Если ЗначениеЗаполнено(ПараметрыОтборов.Договор) Тогда
		мОбъектыРасчета = ПолучитьМассивОбъектов(
			ПараметрыОтборов.Организация, 
			ПараметрыОтборов.Район, 
			ПараметрыОтборов.ПериодНачисленияТекущий, 
			ПараметрыОтборов.Договор);
		
		ПараметрыОпераций.Вставить("мОбъектыРасчета",	мОбъектыРасчета);
		ПараметрыОпераций.Вставить("Договор",			ПараметрыОтборов.Договор);
	Иначе
		ПараметрыОпераций.Вставить("мОбъектыРасчета",	Неопределено);
		ПараметрыОпераций.Вставить("Договор",			Неопределено);
	КонецЕсли;
	
	Возврат ПараметрыОпераций;
	
КонецФункции

Функция ПолучитьМассивОбъектов(Организация, Район, Период, Договор)
	
	МассивОбъектов = Неопределено;
	РезультатЗапроса = РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(Организация, Район, Период, Договор);
	ТЗ = РезультатЗапроса.Выгрузить();
	Если ТЗ.Количество() <> 0 Тогда
		ТЗ.Свернуть("ОбъектРасчета");
		МассивОбъектов = ТЗ.ВыгрузитьКолонку("ОбъектРасчета");
	КонецЕсли;
	Возврат МассивОбъектов;
	
КонецФункции

#КонецОбласти 


#Область ПодготовкаВыполняемыхОпераций

Процедура ПолучитьСписокОпераций(ВыполняемыеОперации, ИмяОперации = Неопределено, ВыполнятьПредыдущие = Неопределено, ТолькоОперацииНП = Ложь)
	
	Операции = Операции(ТолькоОперацииНП);
	
	Если ИмяОперации =Неопределено тогда // выполнение всех операций
		для Каждого стр из Операции цикл
			ВыполняемыеОперации.вставить(стр.ключ,стр.Значение);
		КонецЦикла;
		Возврат ;
	иначе
		
	КонецЕсли;
	
	для Каждого стр из Операции цикл
		Если стр.Значение = ИмяОперации тогда
			ИндексОперации  = Число(СтрЗаменить(стр.Ключ,"Операция",""));
		КонецЕсли; 		
	КонецЦикла;
	
	Если ВыполнятьПредыдущие = Неопределено тогда
		// выполняем только одну операцию		
		ВыполняемыеОперации.вставить("Операция" + 0,Операции["Операция" + ИндексОперации]);
		Возврат;
	КонецЕсли;	
	
	Если ВыполнятьПредыдущие тогда
		для Строка = 0 по ИндексОперации-1 цикл
			ВыполняемыеОперации.вставить("Операция" + Строка,Операции["Операция" + Строка]);
		КонецЦикла; 		
	иначе
		Счетчик  = 0;
		для Строка = ИндексОперации по Операции.Количество() - 1 цикл
			ВыполняемыеОперации.вставить("Операция" + Счетчик,Операции["Операция" + Строка]);
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РезультатВыполненияОперацийНачислений   

Процедура ЗаполнитьСтрокуРезультатаОперации(СтрокаЗаписиРезультата, ПараметрыОтборов, Контекст, ИмяОперации)
	
	СтрокаЗаписиРезультата.Период = ТекущаяДатаСеанса();
	СтрокаЗаписиРезультата.ПериодНачисления = ПараметрыОтборов.ПериодНачисления;
	СтрокаЗаписиРезультата.Организация = ПараметрыОтборов.Организация;
	СтрокаЗаписиРезультата.Район = ПараметрыОтборов.Район; 
	СтрокаЗаписиРезультата.Операция = ИмяОперации;
	СтрокаЗаписиРезультата.ИдентификаторГруппировкиЗаданий = Контекст.ИдентификаторЗадания;
	СтрокаЗаписиРезультата.Пользователь = Контекст.Пользователь;
	СтрокаЗаписиРезультата.ПорядокОперации = Контекст.ПорядокОперации;
	
КонецПроцедуры


Процедура ЗаписатьНачалоОперации(Контекст, СтрокаЗаписиРезультата)
	
	Попытка 	
		Контекст.ФиксаторРезультатаВыполнения.ЗаписатьНачалоОперации(СтрокаЗаписиРезультата);		
	Исключение
	   	Инфо = ИнформацияОбОшибке();
	КонецПопытки;
	                  	
КонецПроцедуры

Процедура ЗаписатьЗавершениеОперации(Контекст, СтрокаЗаписиРезультата)
	
	Попытка	
		Контекст.ФиксаторРезультатаВыполнения.ЗаписатьЗавершениеОперации(СтрокаЗаписиРезультата);	
	Исключение
	   	Инфо = ИнформацияОбОшибке();
	КонецПопытки;
	
КонецПроцедуры   
	
#КонецОбласти

Процедура ОчиститьОчередьНачислений(МенеджерРС, Выборка)
	
	НаборЗаписей = энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(МенеджерРС);
	НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
	НаборЗаписей.Отбор.Район.Установить(Выборка.Район);
	НаборЗаписей.Отбор.ПериодНачисления.Установить(Выборка.ПериодНачисления);
	НаборЗаписей.Отбор.ИсключаяОтдельностоящие.Установить(Выборка.ИсключаяОтдельностоящие);
	
	Попытка
		
		НаборЗаписей.Записать();	
		
	Исключение
		Инфо = ИнформацияОбОшибке();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
